// Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.

// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

//================================================================================================================================================

//Решение:

// Console.WriteLine("Для получения списка натуральных чисел от N до 1, введите значение N: ");
// int number = int.Parse(Console.ReadLine()!);

// Console.Write($"N = {number} -> ");
// PrintN(number, 0);

// void PrintN(int n, int end){
//     if(n == end){
//         return;
//     } else {
//         Console.Write($"{n}");
//         if(n != 1){
//             Console.Write(", ");
//         }
//         n--;
//         PrintN(n, end);
//     }
// }

//================================================================================================================================================